## Вопросы
> - Кодирование - Это представление информации в форме удобной для её хранения, передачи и обработки.
>
> - Информацию кодируют для шифрования разного рода сообщений
>
> - Кодом так же называют набор знаков закодированного сообщения 
>
> - В коде морзе используются тире и точки и зачастую он шифруется на английском алфавите
>
> - Английская буква "Е" имеет код "." а буква "Т" имеет код "_" , вероятно они самые короткие поскольку используются чаще всего
>
> - В теории можно было бы чуть чуть упростить азбуку морзе используя короткие коды для шифрования частых словосочетаний/буквосочетаний
>
> - ._ .-. ... . _. .___ .. 
>
> - чтобырасшифрованныйтекстнепревращалсявподобнуюбольшуюлеберберду
>
> - Kogda len' pisat' na russkom ili zhe kogda v komp'yuterah sobesednikov ne vstroen kakoj libo yazyk
>
> - На самом деле много где , я видел в некоторых видов часов. ( Но сейчас чаще всего ими обозначают века в учебниках и других литературных материалах )
>
> - Возможно для того что бы чеки и подобные бумажки было сложнее подделать 
>
> - Это кодирование с помощью двух знаков - 0 и 1 (песня кстати такая есть [1-0])
>
> - В теории можно будет поробовать на практике не уверен
>
> - В двоичном кодировании один символ равен одному биту , так что чем длинее двоичный код тем больше памаяти будет использовано

## Задачи
> - В коде морзе существует 16 различных последовательностей из точек и тире длинна которых составляет 4 символа , а те что состоят из 6 символов существуют в количестве 64 экземпляров
>
> - 32 
>
> - 2048 
>
> - 625
>
> - 3^4 (даже алфавит сильнее меня...)
>
> - 6^3 = 216
>
> - 3 символа
>
> - наименьшее количество лампочек должно быть 4
>
> - 4 сообщения
> 
> - 32 полагаю (2^5)
>
> - 625 (5^4)
>
> - 21 или 81
>
> - 4 цвета
>
> - 24
>
> - **Продолжение следует...**
