## Вопросы
1. Аналоговыйсигнал - это сигнал, порождаемый физическим процессом, параметры которого можно измерить в любой момент времени
2. Часы синтезатор телефон компьютер
3. Аналоговые компуктеры - были узкоспециалезированными а цифровые универсал
4. оцифровка - это преобразовывание аналогового сигнала в двоичный код
5. Интервал дискретизации - Промежуток времени между соседними отсчетами в масштабе времени.
6. Чем выше частота дискретизации, тем меньше информации при кодировании теряется, но объем файла увеличивается
7. 8 кГц 11 кГц 22 кГц 44,1 кГц
8. Выбор частоты дискретизации зависит от целей записи звука.
9. Потому что это оптимальная частота, если кодировать звук с большей частотой, то человеческим ухом такая разница заметная не будет.
10. Для скрытия обмена данными сигнал смещён в область ультразвука и передача ведётся на частоте от 18kHz до 24kHz, находящейся вне слышимого диапазона у большинства взрослых людей. Среди факторов, влияющих на дальность и скорость передачи, отмечается наличие посторонних звуков, препятствия между приёмником и передатчиком, ориентация и размер громкоговорителя. В качестве меры для противодействия использованию колонок вместо микрофона рекомендуется подключать устройства вывода звука через специальные фильтры.
11. Дискретизация (или квантование по уровню) – это представление непрерывного ряда информационных аналоговых сигналов в виде дискретного ряда.
12. Этот процесс называется оцифровкой. Выполняет его специальное устройство внутри компьютера — звуковая карта.
13. Разрядность – это количество бит цифровой информации для кодирования каждого сэмпла. Проще говоря, разрядность определяет «точность» измерения входного сигнала. Чем больше разрядность, тем меньше погрешность каждого отдельного преобразования величины электрического сигнала в число и обратно.
14. Преимущество: точность при копировании и передачи звукового потока - оригинал ничем не отличается от копии ,более широкий выбор программ и систем
Недостаток:сигнал в цифровом виде является промежуточной стадией и точность конечного аналогового сигнала будет зависеть от того, насколько подробно и точно будет описана координатами звуковая волна.
15. Звук (точнее электрический сигнал микрофона) оцифровывается  в последовательность чисел, что и называется оцифрованным звуком.
Для удобства хранения  оцифрованного звука (фактически - последовательности чисел) и для уменьшения требуемого объема памяти, этот поток чисел сжимается или кодируется. В результате получается новая последовательность чисел, занимающая значительно меньший объем. Собственно алгоритм кодирования и порядок записи полученной цифровой информации и называют форматом хранения оцифрованного звука.
16. Потоковая музыка (или стриминг) — это метод прямой передачи аудио на ваше устройство, не требующий загрузки на него файлов из сети. В прошлом, чтобы слушать музыку на телефоне, её нужно было сначала скачать в нужном аудиоформате.
17. Под этим термином чаще всего понимают процесс создания треков с помощью секвенсоров, синтезаторов и специального ПО. Но некоторые инженеры-музыканты считают такой подход моветоном. Сторонники этой точки зрения используют программный код и специализированные ЯП для создания своих композиций.
18. "Волновая-таблица" это название, данное небольшому количеству цифрового звука (сэмпловым данным или сигналу), который воспроизводится циклически. Частота (высота тона) нажимаемой ноты задаёт скорость, с которой этот сигнал воспроизводится (скорость между повторами).
19. Многоканальный звук, как собственно следует из названия, предполагает передачу звуковой информации зрителю не через один канал, а через несколько. Тем самым создается впечатление, что звук идет от нескольких источников. Звук словно окружает зрителя, дает ощущение погружения.
20. Какой формат MIDI? Формат MIDI - это полностью синтезированная фонограмма. В самом формате уже заложена возможность изменения тональности темпа и возможность использования мелодии-подсказки с помощью одного из инструментов, входящих в фонограмму.
21. Основной момент, чем синтезатор отличается от цифрового пианино – это клавиатура. У первого инструмента более легкие, мягкие и невесомые клавиши. Производители же цифровых пианино делают все возможное, чтобы клавиши этого инструмента максимально напоминали ощущение от игры на акустическом фортепиано.
22. Существует еще один, принципиально иной способ кодирования звука, который можно применить только для кодирования инструментальных мелодий. Он основан на стандарте MIDI (англ. Musical Instrument Digital Interface — цифровой интерфейс музыкальных инструментов). В отличие от оцифрованного звука в таком формате хранятся последовательность нот, коды инструм.
23. Потому что используютсяч различные синтезаторы.
24. Точное совпадение несколько процессов.
25. 48 кГц
26. При меньшей частоте человеческий глаз уже успевает отслеживать смену кадров, из-за чего возникает мерцание и дёрганость движений.
27. Потому что изображения, создаваемые в растровых программах, всегда занимают много памяти.
28. Сжатие данных с потерями — метод сжатия данных, при использовании которого распакованные данные отличаются от исходных, но степень отличия не существенна с точки зрения их дальнейшего использования.
29. MP4. MOV. WMV. AVI. AVCHD. FLV. F4V. SWF. MKV. WEBM. HTML5.


## Задачи
1. ![image](https://github.com/user-attachments/assets/b6dc4215-3dda-414c-a63e-57c0a9cf48b9)

2- ![image](https://github.com/user-attachments/assets/a27418f4-cade-435a-adc3-6c61b8aea32c)


2. Частота дискретизации, кГц 8 8 11 11 22 22 44,1 44,1 48 48

Моно/стерео моно стерео моно стерео моно стерео моно стерео моно МОНО

Время звучания,с 16 4 238 64 320 16 256 64 40 80

Объём файла, Кбайт 375 125 4125 4125 20625 1375 11025 11025 1875 11250

Глубина кодирования, битов 24 16 24 24 24 16 8 6 8 24
